NikolayBobovnikov/ircapture/auvir_embed/stm32_cmake/stm32test-HAL/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2015 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */
#include <string.h>
#include <math.h>
#include "I2Cdev.h"
#include "MPU6050.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
typedef struct
{
    int16_t Accelerometer_X;
    int16_t Accelerometer_Y;
    int16_t Accelerometer_Z;
    int16_t Temperature;
    int16_t Gyroscope_X;
    int16_t Gyroscope_Y;
    int16_t Gyroscope_Z;
    uint32_t delta_time;
} MPU6050_MotionData_t;

typedef struct
{
    int mean_ax;
    int mean_ay;
    int mean_az;
    int mean_gx;
    int mean_gy;
    int mean_gz;
    int var_ax;
    int var_ay;
    int var_az;
    int var_gx;
    int var_gy; 
    int var_gz;
    int offset_ax;
    int offset_ay;
    int offset_az;
    int offset_gx;
    int offset_gy;
    int offset_gz;
} MPU6050_CalibrationData_t;

enum UART_Commands {
    UART_COMMAND_NOT_RECEIVED = 0,
    UART_REQUEST_SEND,
    UART_REQUEST_STOP,
    UART_REQUEST_SEND_BYTE,
    UART_REQUEST_SEND_MPU6050_TEST_DATA,
    UART_REQUEST_SEND_MPU6050_DATA,
    UART_REQUEST_CALIB_DATA,

    UART_TEST_CONNECTION,			// request
    UART_CONNECTION_FAILURE,
    UART_CONENCTION_OK,

    UART_MPU6050_TEST_CONNECTION,	// request
    UART_MPU6050_CONENCTION_FAILURE,
    UART_MPU6050_CONENCTION_OK,
    UART_NULL_RESPONSE
};

static MPU6050_MotionData_t motion_data;
static MPU6050_CalibrationData_t calibration_data;
static uint8_t motion_data_buffer[sizeof(MPU6050_MotionData_t)];
const size_t max_string_lengh = 127;
static float angle_x = 0.0;
static float angle_y = 0.0;
static float angle_z = 0.0;


//Change this 3 variables if you want to fine tune the skecth to your needs.
static const int buffersize=200;     //Amount of readings used to average, make it higher to get more precision but sketch will be slower  (default:1000)
static const int acel_deadzone=50;     //Acelerometer error allowed, make it lower to get more precision, but sketch may not converge  (default:8)
static const int giro_deadzone=10;     //Giro error allowed, make it lower to get more precision, but sketch may not converge  (default:1)

static int16_t ax, ay, az,gx, gy, gz;
static int state=0;


#define LED_PIN GPIO_PIN_8
#define LED_PORT GPIOC

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C2_Init(void);
static void MX_TIM4_Init(void);
static void MX_USART1_UART_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
extern float truncf(float x);

void init_led_hal();
void init_led();
void led_on();
void led_off();
void led_hal();
bool usart_send_str_ok(const char *input);
void usart_send_str(const char *input);
void Calibrate_Gyros();
void Get_Accel_Values();
void Get_Accel_Angles();
void Get_Gyro_Rates();
void MPU6050_getAllData();
void MPU6050_process_data();
void usart_wait_exec_loop();
void meansensors();
void calibration();
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
int main(void)
{

    /* USER CODE BEGIN 1 */

    /* USER CODE END 1 */

    /* MCU Configuration----------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock */
    SystemClock_Config();

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_I2C1_Init();
    MX_I2C2_Init();
    MX_TIM4_Init();
    MX_USART1_UART_Init();

    /* USER CODE BEGIN 2 */
    HAL_TIM_Base_Start(&htim4);

    init_led_hal();

    I2Cdev_hi2c = &hi2c1;
    MPU6050_setAddress(MPU6050_ADDRESS_AD0_LOW);
    MPU6050_reset();
    bool connected = MPU6050_testConnection();
    while(!MPU6050_testConnection());
    MPU6050_initialize();
    /* USER CODE END 2 */

    /* Infinite loop */
    /* USER CODE BEGIN WHILE */
    while (1)
    {
        /* USER CODE END WHILE */

        /* USER CODE BEGIN 3 */
        //usart_wait_exec_loop();
    	mpu6050_loop();
    }
    /* USER CODE END 3 */

}

/* USER CODE END 0 */

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

    RCC_OscInitTypeDef RCC_OscInitStruct;
    RCC_ClkInitTypeDef RCC_ClkInitStruct;

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue = 16;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0);

    HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

    /* SysTick_IRQn interrupt configuration */
    HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* I2C1 init function */
void MX_I2C1_Init(void)
{

    hi2c1.Instance = I2C1;
    hi2c1.Init.ClockSpeed = 100000;
    hi2c1.Init.DutyCycle = I2C_DUTYCYCLE_2;
    hi2c1.Init.OwnAddress1 = 0;
    hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLED;
    hi2c1.Init.OwnAddress2 = 0;
    hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLED;
    hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLED;
    HAL_I2C_Init(&hi2c1);

}

/* I2C2 init function */
void MX_I2C2_Init(void)
{

    hi2c2.Instance = I2C2;
    hi2c2.Init.ClockSpeed = 100000;
    hi2c2.Init.DutyCycle = I2C_DUTYCYCLE_2;
    hi2c2.Init.OwnAddress1 = 0;
    hi2c2.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    hi2c2.Init.DualAddressMode = I2C_DUALADDRESS_DISABLED;
    hi2c2.Init.OwnAddress2 = 0;
    hi2c2.Init.GeneralCallMode = I2C_GENERALCALL_DISABLED;
    hi2c2.Init.NoStretchMode = I2C_NOSTRETCH_DISABLED;
    HAL_I2C_Init(&hi2c2);

}

/* TIM4 init function */
void MX_TIM4_Init(void)
{

    TIM_ClockConfigTypeDef sClockSourceConfig;
    TIM_MasterConfigTypeDef sMasterConfig;

    htim4.Instance = TIM4;
    htim4.Init.Prescaler = 24000;
    htim4.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim4.Init.Period = 24000;
    htim4.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    HAL_TIM_Base_Init(&htim4);

    sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
    HAL_TIM_ConfigClockSource(&htim4, &sClockSourceConfig);

    sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
    sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    HAL_TIMEx_MasterConfigSynchronization(&htim4, &sMasterConfig);

}

/* USART1 init function */
void MX_USART1_UART_Init(void)
{

    huart1.Instance = USART1;
    huart1.Init.BaudRate = 115200;
    huart1.Init.WordLength = UART_WORDLENGTH_8B;
    huart1.Init.StopBits = UART_STOPBITS_1;
    huart1.Init.Parity = UART_PARITY_NONE;
    huart1.Init.Mode = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    HAL_UART_Init(&huart1);

}

/** Configure pins as
        * Analog
        * Input
        * Output
        * EVENT_OUT
        * EXTI
*/
void MX_GPIO_Init(void)
{

    /* GPIO Ports Clock Enable */
    __GPIOB_CLK_ENABLE();
    __GPIOA_CLK_ENABLE();

}

/* USER CODE BEGIN 4 */
void init_led_hal()
{
    __GPIOC_CLK_ENABLE();

    GPIO_InitTypeDef gpio;
    gpio.Mode = GPIO_MODE_OUTPUT_PP;
    gpio.Pin = LED_PIN;
    gpio.Speed = GPIO_SPEED_LOW;
    gpio.Pull = GPIO_PULLDOWN;

    HAL_GPIO_Init(LED_PORT, &gpio);
}
void init_led()
{
    // = = = = = = = = = = = = = = = = = =
    // enable clock for gpio port C
    // = = = = = = = = = = = = = = = = = =
    RCC->APB2ENR |= RCC_APB2ENR_IOPCEN;

    // = = = = = = = = = = = = = = = = = =
    // setup GPIO port C pin 8 for output
    // = = = = = = = = = = = = = = = = = =
    // output mode push-pull - by default
    // setup speed 2Mhz
    GPIOC->CRH &= (~GPIO_CRH_CNF8);
    GPIOC->CRH |= GPIO_CRH_MODE8_1;

}
void led_on()
{
    GPIOC->BSRR |= GPIO_BSRR_BS8;
}
void led_off()
{
    GPIOC->BRR |= GPIO_BRR_BR8;
}
void led_hal()
{
    HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
    HAL_Delay(1000);
    //HAL_GPIO_WritePin(GPIOC, LED_PIN, GPIO_PIN_SET);
}
void init_uart()
{

    /* Initialize GPIO for transmit/receive pin */

    RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;

    //Transmit register - pin 9
    //MODE: 11: Output mode, max speed 50 MHz.
    GPIOA->CRH |= GPIO_CRH_MODE9;

    //10: Alternate function output Push-pull
    GPIOA->CRH &= (~GPIO_CRH_CNF9);
    GPIOA->CRH |= GPIO_CRH_CNF9_1;

    //Receive register - pin 10
    // MODE: 00: Input mode (reset state)
    GPIOA->CRH &= (~GPIO_CRH_MODE10);
    // CNF: 01: Floating input (reset state)
    GPIOA->CRH &= (~GPIO_CRH_CNF10);
    GPIOA->CRH |= GPIO_CRH_CNF10_0;


    /* Initialize uart peripheral*/

    RCC->APB2ENR |= RCC_APB2ENR_IOPAEN | RCC_APB2ENR_USART1EN;
    //1. Enable the USART by writing the UE bit in USART_CR1 register to 1.
    USART1->CR1 |= USART_CR1_UE;                // Uart Enable
    //2. Program the M bit in USART_CR1 to define the word length.
    USART1->CR1 &= (~USART_CR1_M);              // 8 bit word - bit M is reset
    //3. Program the number of stop bits in USART_CR2.
    USART1->CR2 &= (~USART_CR2_STOP);           // 1 stop bit - 00
    /*4. Select DMA enable (DMAT) in USART_CR3 if Multi buffer Communication is to take
    place. Configure the DMA register as explained in multibuffer communication.*/
    USART1->CR3 &= (~USART_CR3_DMAT);           // DMA disabled
    //5. Select the desired baud rate using the USART_BRR register.
    USART1->BRR = (SystemCoreClock / 115200);   //9600 or 115200 bps
    //6. Set the TE bit in USART_CR1 to send an idle frame as first transmission.
    USART1->CR1 |= USART_CR1_TE;

}

bool usart_send_str_ok(const char *input)
{
    char string[max_string_lengh + 1];
    strncpy(string, input, sizeof(string));   // copy input without exceeding the length of the destination
    string[sizeof(string) - 1] = '\0';        // if strlen(input) = sizeof(str) then strncpy won't NUL terminate
    size_t bytes_to_sent = strlen(string) + 1; // length of input string + 1 if it is less than max_string_lengh; max_string_lengh otherwise

    // TODO: study signed/unsigned conversion below
    HAL_StatusTypeDef trans = HAL_UART_Transmit(&huart1, (uint8_t*) string, bytes_to_sent, 1000);
    if(HAL_OK == trans)
    {
        return true;
    }
    return false;
}

void usart_send_str(const char *input)
{
    usart_send_str_ok(input);
}

void MPU6050_getAllData()
{
    // get time of arrival
    motion_data.delta_time = __HAL_TIM_GET_COUNTER(&htim4);
    // get new data
    I2Cdev_readBytes(MPU6050_ADDRESS_AD0_LOW, MPU6050_RA_ACCEL_XOUT_H, 14, motion_data_buffer, 1000);
    // reset timer
    __HAL_TIM_SET_COUNTER(&htim4, 0);

    //HAL_I2C_Master_Transmit(I2Cdev_hi2c, devAddr << 1, &regAddr, 1, tout);
    //HAL_I2C_Master_Receive(I2Cdev_hi2c, devAddr << 1, motion_data_buffer, 14, tout);
    //HAL_StatusTypeDef status = HAL_I2C_Mem_Read(I2Cdev_hi2c, MPU6050_ADDRESS_AD0_LOW << 1, MPU6050_RA_ACCEL_XOUT_H, 1, motion_data_buffer, 14, 1000);


    motion_data.Accelerometer_X = (((int16_t)motion_data_buffer[0]) << 8) | motion_data_buffer[1];
    motion_data.Accelerometer_Y = (((int16_t)motion_data_buffer[2]) << 8) | motion_data_buffer[3];
    motion_data.Accelerometer_Z = (((int16_t)motion_data_buffer[4]) << 8) | motion_data_buffer[5];
    motion_data.Temperature    = (((int16_t)motion_data_buffer[6]) << 8) | motion_data_buffer[7];
    motion_data.Gyroscope_X    = (((int16_t)motion_data_buffer[8]) << 8) | motion_data_buffer[9];
    motion_data.Gyroscope_Y    = (((int16_t)motion_data_buffer[10])<< 8) | motion_data_buffer[11];
    motion_data.Gyroscope_Z    = (((int16_t)motion_data_buffer[12])<< 8) | motion_data_buffer[13];
}

void MPU6050_process_data()
{
    //x_acc = (float)(x_acc_ADC – x_acc_offset) * x_acc_scale;
        //gyro = (float)(gyro_ADC – gyro_offset) * gyro_scale;
        //angle = (0.98)*(angle + gyro * dt) + (0.02)*(x_acc);

        //x_acc = (float)(x_acc_ADC – x_acc_offsetGYRO_XOUT_OFFSET) * x_acc_scale;
        angle_x = (0.98)*(angle_x + motion_data.Gyroscope_X * motion_data.delta_time) + (0.02)*(motion_data.Accelerometer_X);
        angle_y = (0.98)*(angle_x + motion_data.Gyroscope_X * motion_data.delta_time) + (0.02)*(motion_data.Accelerometer_X);
        angle_z = (0.98)*(angle_x + motion_data.Gyroscope_X * motion_data.delta_time) + (0.02)*(motion_data.Accelerometer_X);
}

void usart_wait_exec_loop()
{
	HAL_StatusTypeDef status;
    while( 1 )
    {
    	//reset command
    	uint8_t command = UART_COMMAND_NOT_RECEIVED;
    	uint8_t response = UART_NULL_RESPONSE;
    	status = HAL_UART_Receive(&huart1, &command, 1, 1000);

        // if received command, dispatch it
        if(status == HAL_OK && UART_COMMAND_NOT_RECEIVED != command)
        {
			if(UART_REQUEST_SEND_MPU6050_DATA == command)
			{
				MPU6050_getAllData();
				HAL_StatusTypeDef status = HAL_UART_Transmit(&huart1, (uint8_t*)&motion_data, sizeof(motion_data), 1000);
				if(status != HAL_OK)
				{
					// TODO: process error
				}
			}
			else if(UART_REQUEST_SEND_MPU6050_TEST_DATA == command)
			{
				motion_data.Accelerometer_X = 1;
				motion_data.Accelerometer_Y = 2;
				motion_data.Accelerometer_Z = 3;
				motion_data.Temperature    = 4;
				motion_data.Gyroscope_X    = 5;
				motion_data.Gyroscope_Y    = 6;
				motion_data.Gyroscope_Z    = 7;
				status = HAL_UART_Transmit(&huart1, (uint8_t*)&motion_data, sizeof(motion_data), 1000);
			}
			else if (UART_REQUEST_CALIB_DATA == command)
			{
				meansensors();
				calibration();
				meansensors();
          
				status = HAL_UART_Transmit(&huart1, (uint8_t*)&calibration_data, sizeof(calibration_data), 1000);
			}
			else if(UART_TEST_CONNECTION == command)
			{
				response = UART_CONENCTION_OK;
				status = HAL_UART_Transmit(&huart1, &response, sizeof(response), 1000);
			}
			else if(UART_MPU6050_TEST_CONNECTION == command)
			{
				if(MPU6050_testConnection())
				{
					response = UART_MPU6050_CONENCTION_OK;
				}
				else
				{
					response = UART_MPU6050_CONENCTION_FAILURE;
				}
				status = HAL_UART_Transmit(&huart1, &response, sizeof(response), 1000);
			}

			// Process error
			if(status != HAL_OK)
			{
				// TODO: process error
			}
        }

        //reset command
        //byte = UART_COMMAND_NOT_RECEIVED
    } // end while
}

void mpu6050_loop()
{
	HAL_StatusTypeDef status;
    if (state==0)
    {
        //usart_send_str("\nReading sensors for first time...\0");
        meansensors();
        state++;
        HAL_Delay(1000);
      }

    if (state==1)
      {
        //usart_send_str("\nCalculating offsets...\0");
        calibration();
        state++;
        HAL_Delay(1000);
      }

    if (state==2)
      {
        meansensors();

        status = HAL_UART_Transmit(&huart1, (uint8_t*)&calibration_data, sizeof(calibration_data), 1000);
                    if(status != HAL_OK)
                	{
                	     // TODO: process error
                	}
        // go back
        state = 0;
      }
}

void meansensors()
{
    long i = 0, buff_ax = 0, buff_ay = 0, buff_az = 0, buff_gx = 0, buff_gy = 0, buff_gz = 0;

    while (i<(buffersize+101))
    {
        // read raw accel/gyro measurements from device
        MPU6050_getMotion6(&ax, &ay, &az, &gx, &gy, &gz);

        if (i>100 && i<= (buffersize+100))
        { //First 100 measures are discarded
            buff_ax = buff_ax+ax;
            buff_ay = buff_ay+ay;
            buff_az = buff_az+az;
            buff_gx = buff_gx+gx;
            buff_gy = buff_gy+gy;
            buff_gz = buff_gz+gz;
            calibration_data.var_ax = (calibration_data.var_ax + abs(buff_ax - ax))/i;
            calibration_data.var_ay = (calibration_data.var_ay + abs(buff_ay - ay))/i;
            calibration_data.var_az = (calibration_data.var_az + abs(buff_az - az))/i;
            calibration_data.var_gx = (calibration_data.var_gx + abs(buff_gx - gx))/i;
            calibration_data.var_gy = (calibration_data.var_gy + abs(buff_gy - gy))/i;
            calibration_data.var_gz = (calibration_data.var_gz + abs(buff_gz - gz))/i;
        }
        if (i == (buffersize+100))
        {
            calibration_data.mean_ax = buff_ax/buffersize;
            calibration_data.mean_ay = buff_ay/buffersize;
            calibration_data.mean_az = buff_az/buffersize;
            calibration_data.mean_gx = buff_gx/buffersize;
            calibration_data.mean_gy = buff_gy/buffersize;
            calibration_data.mean_gz = buff_gz/buffersize;
        }
        i++;
        HAL_Delay(2); //Needed so we don't get repeated measures
    }
}

void calibration()
{
    calibration_data.offset_ax =        -calibration_data.mean_ax /8;
    calibration_data.offset_ay =        -calibration_data.mean_ay /8;
    calibration_data.offset_az = (16384 -calibration_data.mean_az)/8;
    calibration_data.offset_gx =        -calibration_data.mean_gx /4;
    calibration_data.offset_gy =        -calibration_data.mean_gy /4;
    calibration_data.offset_gz =        -calibration_data.mean_gz /4;

    int iter_numer = 10;
    while (iter_numer-- != 0)
    {
        int ready = 0;
        MPU6050_setXAccelOffset(calibration_data.offset_ax);
        MPU6050_setYAccelOffset(calibration_data.offset_ay);
        MPU6050_setZAccelOffset(calibration_data.offset_az);
        MPU6050_setXGyroOffset (calibration_data.offset_gx);
        MPU6050_setYGyroOffset (calibration_data.offset_gy);
        MPU6050_setZGyroOffset (calibration_data.offset_gz);

        meansensors();

        if (abs(calibration_data.mean_ax)<= acel_deadzone) ready++ ;
        else calibration_data.offset_ax = calibration_data.offset_ax - calibration_data.mean_ax / acel_deadzone;

        if (abs(calibration_data.mean_ay)<= acel_deadzone) ready++ ;
        else calibration_data.offset_ay = calibration_data.offset_ay - calibration_data.mean_ay / acel_deadzone;

        if (abs(16384 - calibration_data.mean_az)<= acel_deadzone) ready++ ;
        else calibration_data.offset_az = calibration_data.offset_az + (16384 - calibration_data.mean_az) / acel_deadzone;

        if (abs(calibration_data.mean_gx)<= giro_deadzone) ready++ ;
        else calibration_data.offset_gx = calibration_data.offset_gx - calibration_data.mean_gx / (giro_deadzone + 1);

        if (abs(calibration_data.mean_gy)<= giro_deadzone) ready++ ;
        else calibration_data.offset_gy = calibration_data.offset_gy - calibration_data.mean_gy / (giro_deadzone + 1);

        if (abs(calibration_data.mean_gz)<= giro_deadzone) ready++ ;
        else calibration_data.offset_gz = calibration_data.offset_gz - calibration_data.mean_gz / (giro_deadzone + 1);

        if (ready == 6) break;

        if(true == iter_numer)
        {
        	int about_to_exceed_tries = 0;
        }
    }
}

/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
    /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
    /* USER CODE END 6 */

}

#endif

/**
  * @}
  */

/**
  * @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
